app/views/profiles/show.html.erb

SELECT COUNT(*) FROM "recipes" WHERE "recipes"."user_id" = $1  [["user_id", 1]]
---
                    <div class="desc"><%= @user.first_name %> <%= @user.last_name %></div>
                    <div class="desc"><%= pluralize @user.recipes.count, 'recipe' %></div>