app/views/recipes/_categorysearch.html.erb

SELECT "categories".* FROM "categories" ORDER BY "categories"."name" ASC
---
      <div class="form-group row form-inline">
      <%= select_tag 'category', options_for_select(Category.all.map{|el| [el.name, el.id]}), prompt: "Filter by Category:", class: 'form-control' %>