app/controllers/categories_controller.rb

SELECT "categories".* FROM "categories" ORDER BY "categories"."name" ASC
---
  def index
    @categories = Category.all.order(name: :asc)

INSERT INTO "categories" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Breakfast"], ["created_at", 2017-04-16 18:12:42 UTC], ["updated_at", 2017-04-16 18:12:42 UTC]]
---
  def create
    @category = Category.new(category_params)

    respond_to do |format|
      if @category.save