app/controllers/profiles_controller.rb

UPDATE "users" SET "avatar_updated_at" = $1, "updated_at" = $2, "avatar_file_name" = $3 WHERE "users"."id" = $4  [["avatar_updated_at", 2017-04-15 15:32:17 UTC], ["updated_at", 2017-04-15 15:32:19 UTC], ["avatar_file_name", "CA_082.JPG"], ["id", 1]]
---
  def update
    respond_to do |format|
        if @user.update(profile_params)

SELECT  "users".* FROM "users" WHERE "users"."user_name" = $1 LIMIT $2  [["user_name", "kleahey"], ["LIMIT", 1]]
---
  def set_user
    @user = User.find_by(user_name: params[:user_name])