app/controllers/recipes_controller.rb

  def index
    @recipes = current_user.recipes.all
---
SELECT "recipes".* FROM "recipes" WHERE "recipes"."user_id" = $1  [["user_id", 1]]

  def new
    @recipe = current_user.recipes.build
    @user = User.find_by(user_name: params[:user_name])
---
SELECT  "users".* FROM "users" WHERE "users"."user_name" = $1 LIMIT $2  [["user_name", "kleahey"], ["LIMIT", 1]]

  def edit
     @user = User.find_by(user_name: params[:user_name])
---
SELECT  "users".* FROM "users" WHERE "users"."user_name" = $1 LIMIT $2  [["user_name", "kleahey"], ["LIMIT", 1]]

  def create
    @recipe = current_user.recipes.build(recipe_params)

    respond_to do |format|
      if @recipe.save
---
INSERT INTO "recipes" ("title", "ingredients", "directions", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", ""], ["ingredients", "Test"], ["directions", "Test"], ["created_at", 2017-04-10 19:35:15 UTC], ["updated_at", 2017-04-10 19:35:15 UTC], ["user_id", 1]]

  def update
    respond_to do |format|
      if @recipe.update(recipe_params)
---
UPDATE "recipes" SET "category_id" = $1, "updated_at" = $2 WHERE "recipes"."id" = $3  [["category_id", 9], ["updated_at", 2017-04-16 19:10:23 UTC], ["id", 6]]